Revit 2027 API
SpecialType Enumeration
 An enumerated type listing special types that can appear in an ExportLayerTable. These types do not represent an independent category in Revit, but can be mapped to specific layers on export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SpecialType
Public Enumeration SpecialType
public enum class SpecialType
type SpecialType
Members
Member name | Value | Description
Default | -1 |  The default value for most Revit categories and subcategories.
ExteriorWall | 2 |  The special type representing exterior walls.
FoundationWall | 3 |  The special type representing foundation walls.
InteriorWall | 1 |  The special type representing interior walls.
RetainingWall | 4 |  The special type representing retaining walls.
See Also
Reference
Autodesk.Revit.DB Namespace